[
    {
        "company": "Ultra-X Bangladesh Ltd.",
        "designation": "Software Engineer",
        "duration": "Sep 2021 – Present",
        "type": "Full-time",
        "description": [
            "Developed and optimized backend systems using Node.js to create scalable, efficient RESTful APIs and microservices, improving response times by 30% and enhancing overall user experience.",
            "Integrated frontend frameworks such as React and Next.js with backend services to ensure seamless data flow, achieving a 20% improvement in page load speed and interactivity for user interfaces.",
            "Created reusable modules for core functionalities like authentication, data validation, and error handling, reducing code redundancy by 35% and accelerating project timelines.",
            "Enhanced data processing and backend performance through caching strategies, asynchronous programming, and optimized database queries, resulting in a 40% decrease in server load and latency.",
            "Worked closely with cross-functional teams to conduct code reviews and technical discussions, contributing to a 25% reduction in bugs and fostering a culture of quality and continuous improvement within the team."
        ],
        "skills": ["React", "NodeJs", "NextJs", "Javascript", "Typescript"]
    },
    {
        "company": "Cokreates Ltd.",
        "designation": "Implementation Coordinator",
        "duration": "Mar 2020 – Sep 2021",
        "type": "Full-time",
        "description": [
            "Conducted comprehensive requirement analysis and coordinated project processes for the Bangladesh e-Government ERP project(GRP), ensuring alignment with user expectations and successful milestone execution.Facilitated user training, troubleshooting, and feedback collection, enhancing user proficiency and minimizing disruptions throughout the ERP system implementation.",
            "Facilitated user training, troubleshooting, and feedback collection, enhancing user proficiency and minimizing disruptions throughout the ERP system implementation."
        ],
        "skills": ["User Communication", "User Training", "Troubleshooting"]
    }
]